{"_id": "python-and-hdf5-a-vision", "author": "Anthony Scopatz", "day": 18, "month": "September", "original": "https://hdfgroup.org/wp/2015/09/python-hdf5-a-vision/", "post": "<strong>“Python</strong></a> is great and its ecosystem for scientific computing is world class. <a style=\"color: #0000ff;\" href=\"https://www.hdfgroup.org/HDF5/\" target=\"_blank\"><strong>HDF5</strong></a> is amazing and is rightly the gold standard for persistence for scientific data.</span>&nbsp; </em><span style=\"color: #0000ff;\"><em>Many people use HDF5 from Python, and this number is only growing due to <strong><a style=\"color: #0000ff;\" href=\"http://pandas.pydata.org/pandas-docs/stable/api.html#hdfstore-pytables-hdf5\" target=\"_blank\">pandas’ HDFStore</a>.</strong>&nbsp; However, using HDF5 from Python has at least one more knot than it needs to.&nbsp; Let’s change that.”</em></span></h4><p><a href=\"/static/img/blog-pytables-picture4-300x203.png\"><img class=\"image-link\" src=\"/static/img/blog-pytables-picture4-300x203.png\" alt=\"Picture4\" height=\"135\" width=\"200\"></p><p></a>Almost immediately when going to use <a href=\"https://www.hdfgroup.org/HDF5/\"><strong>HDF5</strong></a> from Python you are faced with a choice between two fantastic packages with overlapping capabilities: <strong><a href=\"http://www.h5py.org/\" target=\"_blank\">h5py</a></strong> and <strong><a href=\"http://www.pytables.org/\" target=\"_blank\">PyTables</a>.</strong>&nbsp; h5py wraps the HDF5 API more closely using autogenerated Cython.&nbsp; PyTables, while also wrapping HDF5, focuses more on a Table data structure and adds in sophisticated indexing and out-of-core querying. Which package you use depends on your use case – and sometimes you really need both!</p><p>At <strong><a href=\"http://scipy2015.scipy.org/ehome/index.php?eventid=115969&amp;\" target=\"_blank\">SciPy 2015</a>,</strong> developers from PyTables, h5py, The HDF Group, pandas, as well as community members sat down and talked about what to do to make the story for Python and HDF5 more streamlined and more maintainable.&nbsp; Here is what we came up with:</p><ul><li>Refactor PyTables to depend on h5py for its bindings to HDF5.</li><li>Update h5py to support the PyTables refactor (some data types are needed, etc.).</li><li>PyTables will keep all of its high-level abstractions.</li><li>Make h5py – PyTables interactions seamless.</li><li>Ensure API and HDF5 file backwards compatibility for both h5py and PyTables.<ul><li>Major version number bump for PyTables, and maybe h5py.</li></ul></li></ul><p>We believe that users and developers will both benefit from this. &nbsp;You will no longer be forced to choose between h5py and PyTables up front. &nbsp;Instead, you’ll be free to move up or down the stack as you want or need to.</p><p><a href=\"/static/img/blog-pytables-image-1-334x360.png\"><img class=\"image-link\" wp-image-1323 \" src=\"/static/img/blog-pytables-image-1-334x360.png\" alt=\"image 1\" height=\"478\" width=\"443\"></a></p><p>The refactor effort is about more than technical superiority. &nbsp;We also see it as a <em>merging of communities</em>. &nbsp;While the projects will remain separate – they fill different niches – they are becoming even more symbiotic than they have been. We believe the refactor will bring more users to both h5py and PyTables. &nbsp;As an important gesture to this end, the core developers for h5py now have push rights to the main PyTables repository and vice versa. &nbsp;We are committed to seeing this vision come to pass.</p><h4>Sustainability, Maintenance, and Funding</h4><p>Something like the proposed new stack has to occur in the long run for the Python and HDF5 ecosystem to remain viable. &nbsp;There is no reason for there to exist two, canonical low-level binding libraries to HDF5.&nbsp; It is a redundant effort not just for the core developers, but also for the community of users. The current situation means that there are now two places where bugs could be reported, two places where nasty unicode issues could come up, two handles to your HDF5 files in memory, and so on. &nbsp;This is unsustainable.</p><p>We believe that the proposed refactor is the best way to address these long standing maintenance issues.&nbsp; PyTables has been around as long as anything.&nbsp; Seriously, work on PyTables began in 2001 – this is before NumPy, as long as IPython, etc.&nbsp; It might be tempting to think that PyTables can go along its merry way. &nbsp;But PyTables has only been around for so long because it has adapted to meet the needs of the day.&nbsp; Right now, the best way for any of the codes to survive is to work together.</p><p>Of course, the best way to ensure that these changes happen is for us to receive funding. &nbsp;This could come from one very generous source, or from multiple organizations. &nbsp;We see three avenues that we’d like to see funded:</p><ul><li>The refactor, requiring ~6 months to 1 year FTE, split between PyTables and h5py.</li><li>Long-term maintenance issues: such as release management, CI, bug fixes, mailing lists responses, etc., &nbsp;for h5py and PyTables requiring ~3 months FTE per year.</li><li>New and novel feature implementations:<ul><li>Columnar data format – <strong><a href=\"https://github.com/PyTables/proposal/blob/master/column-wise-pytables.rst\">We’ve wanted this in PyTables for many years. &nbsp;</a></strong> Matt Rocklin does a great job of <strong><a href=\"http://matthewrocklin.com/blog/work/2015/08/28/Storage/\">explaining the idea</a>.</strong><ul><li>Faster read/write</li><li>Improved compression</li><li>Dynamically add fields</li></ul></li><li>Single Write-Multiple Read support</li><li>Rich<strong><code>getitem</code></strong> indexing, à la pandas.</li><li>Improved Indexing and Querying for multi-dimensional datasets, à la dask.</li><li>and more!</li></ul></li></ul><p>A major problem with fundraising, though, is the question of, “Where does the money go?”&nbsp; Well, we are excited to announce that we have solved this problem because…</p><h4>PyTables is now a NumFOCUS Project!</h4><p>As of August 29th, 2015, the PyTables’ core developers have signed a <a href=\"http://numfocus.org/projects/join-as-project.html\" target=\"_blank\"><strong>comprehensive fiscal sponsorship agreemen</strong>t</a> with <strong><a href=\"http://numfocus.org/\" target=\"_blank\">NumFOCUS</a></strong> (NF), a 501(c)3 non-profit for scientific computing. &nbsp;We are honored to join with the ranks of IPython/Jupyter, Matplotlib, Julia, SymPy, Software Carpentry, Data Carpentry, and others. &nbsp;More importantly, we can accept tax-deductible donations for Python and HDF5 activities. This includes hiring people to do the work described above. We are super excited.</p><p><strong>For individuals seeking to give to the projects, we will have a PayPal link soon. &nbsp;For larger organizations, please contact the core developers of PyTables or h5py or NumFOCUS. &nbsp;We are more than happy to write competitive proposals.&nbsp; If you know of any and would like us to apply, please let us know.</strong></p><p>If you are a potential funder and are restricted from giving to non-profits, don’t worry!&nbsp; Both h5py and PyTables have core developers who are able to PI projects at R1 universities in the United States.</p><p>Of course, if coding is more your style, we always will review any pull requests that come through.&nbsp; If you need help getting started, just ask us and we’ll happily guide you along.</p><p><strong>So no matter who you are, or what your interest is, we are here, ready, and able to help make Python &amp; HDF5 work even better together than they already do. The proposal here is what we want and is the result of wall-clock months of collective effort.&nbsp; Many of us cannot afford to see these projects disappear.&nbsp; Streamlining the stack will help ensure that both h5py and PyTables are healthy and vibrant for the foreseeable future. &nbsp;</strong></p><p><strong>Please, let’s make this vision become a reality!</strong></p><p>PyTables Governance Team – Anthony Scopatz, Francesc Alted, Antonio Valentino, Andrea Bedini</p><p>h5py Core Developers – Andrew Collette</p><h4>Acknowledgements</h4><p>Huge thanks to NumFOCUS for providing us with fiscal sponsorship. The importance of this cannot be understated.</p><p>Many thanks to The HDF Group (Mike Folk, John Readey, and Gerd Herber in particular) for encouraging and engaging with us throughout this whole process.</p><p><em>Editor’s Note:&nbsp; Anthony has made many wonderful contributions to the HDF5 cause, including his aptly-titled <a href=\"https://www.youtube.com/watch?v=EoqGt32gkPc\" target=\"_blank\"><strong>“HDF5 is for Lovers”</strong></a> tutorials.&nbsp; Thank you, Anthony!</em></p><p>Related Links:</p><p><strong><a href=\"http://www.pytables.org/FAQ.html#how-does-pytables-compare-with-the-h5py-project\" target=\"_blank\">http://www.pytables.org/FAQ.html#how-does-pytables-compare-with-the-h5py-project</a></strong></p><p>For information about NumPy, pandas, and IPython, see.&nbsp; <a href=\"https://hdfgroup.org/wp/2015/07/hdf-at-scipy2015/\" target=\"_blank\"><strong>https://hdfgroup.org/wp/2015/07/hdf-at-scipy2015/</strong></a>.</p><p>For more about h5py:<a href=\"http://h5py:%20https://hdfgroup.org/wp/2015/03/hdf5-as-a-zero-configuration-ad-hoc-scientific-database-for-python/\" target=\"_blank\"><strong> https://hdfgroup.org/wp/2015/03/hdf5-as-a-zero-configuration-ad-hoc-scientific-database-for-python/</strong></a>.</p>", "title": "Python & HDF5 - A Vision", "year": 2015}